app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name ilike '%bake%')
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "description", "quantity", "sku", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "tes"], ["description", "test"], ["quantity", 1], ["sku", "test"], ["price", "2.0"], ["created_at", "2015-05-16 23:58:49.227927"], ["updated_at", "2015-05-16 23:58:49.227927"]]
---
  def create
    @product = Product.new(params.require(:product).permit(:name,:description,:quantity,:sku,:price))
    @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "products" SET "name" = $1, "description" = $2, "quantity" = $3, "sku" = $4, "price" = $5, "updated_at" = $6 WHERE "products"."id" = $7  [["name", "New Test"], ["description", "werterg"], ["quantity", 8], ["sku", "CH-2001"], ["price", "18.0"], ["updated_at", "2015-05-18 01:09:14.592551"], ["id", 12]]
---
  def update
    product = Product.find(params[:id])
    product.update_attributes(params.require(:product).permit(:name,:description,:quantity,:sku,:price))

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def destroy
    product = Product.find(params[:id])
    product.destroy